### TCP头部报文

- ![](TCP头部报文.png)
- 序列号：
  - 在建⽴连接时由计算机⽣成的随机数作为其初始值，通过 SYN 包传给接收端主机，每发送⼀次数据，就 「累加」⼀次该「数据字节数」的⼤⼩。⽤来解决⽹络包乱序问题
- 确认应答号：
  - 指下⼀次「期望」收到的数据的序列号，发送端收到这个确认应答以后可以认为在这个序号以前的数 据都已经被正常接收。⽤来解决不丢包的问题
- ACK：
  - 该位为 1 时，「确认应答」的字段变为有效
  - TCP 规定除了最初建⽴连接时的 SYN 包之外该位必 须设置为 1
- RST：
  - 该位为 1 时，表示 TCP 连接中出现异常必须强制断开连接
- SYN：
  - 该位为 1 时，表示希望建⽴连接，并在其「序列号」的字段进⾏序列号初始值的设定
- FIN：
  - 该位为 1 时，表示今后不会再有数据发送，希望断开连接。当通信结束希望断开连接时，通信双⽅的主机之间就可以相互交换 FIN 位为 1 的 TCP 段



### TCP的概念

- 是面向连接，可靠的，基于字节流的传输层通信结构
  - 面向连接：一定是一对一连接
  - 可靠的：⽆论的⽹络链路中出现了怎样的链路变化，TCP 都可以保证⼀个报⽂⼀定能够到达接收端
  - 字节流：：消息是「没有边界」的，所以⽆论我们消息有多⼤都可以进⾏传输。并且消息是「有序的」



### TCP连接

- ⽤于保证可靠性和流量控制维护的某些状态信息，这些信息的组合，包括Socket、序列号和窗⼝ ⼤⼩称为连接
- 需要三个信息才能达成共识
  - Socket：由 IP 地址和端⼝号组成 
  - 序列号：⽤来解决乱序问题等 
  - 窗⼝⼤⼩：⽤来做流ᰁ控制



### 确定唯一的TCP连接

- 四元组（源地址，源端口，目的地址，目的端口）



